; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon15)
)
(:goal (and
	(pointing satellite0 Planet5)
	(pointing satellite1 Star6)
	(pointing satellite2 Star0)
	(pointing satellite3 Planet14)
	(have_image Planet5 spectrograph1)
	(have_image Star6 thermograph0)
	(have_image Star7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 thermograph0)
	(have_image Phenomenon15 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation3 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 15
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 15
3. (calibrate satellite3 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 15
4. (turn_to satellite3 planet5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet5)
   goals met: 0 of 15
5. (take_image satellite3 planet5 instrument5 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 1 of 15
6. (turn_to satellite3 planet11 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 planet11)
   goals met: 1 of 15
7. (take_image satellite3 planet11 instrument5 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 2 of 15
8. (turn_to satellite3 phenomenon15 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon15)
   goals met: 2 of 15
9. (take_image satellite3 phenomenon15 instrument5 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 3 of 15
10. (turn_to satellite3 phenomenon13 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 phenomenon13)
   goals met: 3 of 15
11. (take_image satellite3 phenomenon13 instrument5 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 15
12. (turn_to satellite3 phenomenon10 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon10)
   goals met: 4 of 15
13. (turn_to satellite1 star6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star6)
   goals met: 5 of 15
14. (turn_to satellite0 planet5 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet5)
   goals met: 6 of 15
15. (take_image satellite3 phenomenon10 instrument5 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 7 of 15
16. (turn_to satellite2 star0 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star0)
   goals met: 8 of 15
17. (turn_to satellite3 planet9 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet9)
   goals met: 8 of 15
18. (take_image satellite3 planet9 instrument5 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 9 of 15
19. (turn_to satellite3 star12 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star12)
   goals met: 9 of 15
20. (take_image satellite3 star12 instrument5 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 10 of 15
21. (turn_to satellite3 star6 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star6)
   goals met: 10 of 15
22. (take_image satellite3 star6 instrument5 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 11 of 15
23. (turn_to satellite3 star7 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star7)
   goals met: 11 of 15
24. (take_image satellite3 star7 instrument5 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 12 of 15
25. (turn_to satellite3 star8 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star8)
   goals met: 12 of 15
26. (take_image satellite3 star8 instrument5 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 13 of 15
27. (turn_to satellite3 planet14 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 planet14)
   goals met: 14 of 15
28. (take_image satellite3 planet14 instrument5 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 15 of 15
